In [4]:
import pandas as pd
import numpy as np

In [151]:
try:
    data = pd.read_csv("astronauts.csv")
    print("dataloaded")
except:
    print("File missing")

dataloaded

In [51]:
data.shape

(357, 19)

In [52]:
data.ndim

2

In [53]:
data.head(1)

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
0,Joseph M. Acaba,2004.0,19.0,Active,5/17/1967,"Inglewood, CA",Male,University of California-Santa Barbara; Univer...,Geology,Geology,NaN,NaN,2,3307,2,13.0,"STS-119 (Discovery), ISS-31/32 (Soyuz)",NaN,NaN

In [54]:
data.tail(3)

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
354,Alfred M. Worden,1966.0,5.0,Retired,2/7/1932,"Jackson, MI",Male,US Military Academy; University of Michigan,Military Science,Aeronautical & Astronautical Engineering,Colonel,US Air Force (Retired),1,295,1,0.5,Apollo 15,NaN,NaN
355,John W. Young,1962.0,2.0,Retired,9/24/1930,"San Francisco, CA",Male,Georgia Institute of Technology,Aeronautical Engineering,NaN,Captain,US Navy (Retired),6,835,3,20.0,"Gemini 3, Gemini 10, Apollo 10, Apollo 16, STS...",NaN,NaN
356,George D. Zamka,1998.0,17.0,Retired,6/29/1962,"Jersey City, NJ",Male,US Naval Academy; Florida Institute of Technology,Mathematics,Engineering Management,Colonel,US Marine Corps (Retired),2,692,0,0.0,"STS-120 (Discovery), STS-130 (Endeavor)",NaN,NaN

In [138]:
data.sample(10)

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
230,Leland D. Melvin,1998.0,17.0,Management,2/15/1964,"Lynchburg, VA",Male,University of Richmond; University of Virginia,Chemistry,Materials Science Engineering,NaN,NaN,2,565,0,0.0,"STS-122 (Atlantis), STS-129 (Atlantis)",NaN,NaN
169,Douglas G. Hurley,2000.0,18.0,Active,10/21/1966,"Endicott, NY",Male,Tulane University,Civil Engineering,NaN,Colonel,US Marine Corps,2,683,0,0.0,"STS-127 (Endeavor), STS-135 (Atlantis)",NaN,NaN
352,David A. Wolf,1990.0,13.0,Retired,8/23/1956,"Indianapolis, IN",Male,Purdue University; Indiana University,Electrical Engineering,Medicine,NaN,NaN,3,4044,7,41.0,STS-58 (Columbia). STS-86/89 (Atlantis/Endeavo...,NaN,NaN
320,William E. Thornton,1967.0,6.0,Retired,4/14/1929,"Faison, NC",Male,University of North Carolina,Physics,Medicine,NaN,NaN,2,315,0,0.0,"STS-8 (Challenger), STS 51-B (Challenger)",NaN,NaN
76,Eileen M. Collins,1990.0,13.0,Retired,11/19/1959,"Elmira, NY",Female,Syracuse University; Stanford University; Webs...,Mathematics & Economics,Operations Research; Space Systems Management,Colonel,US Air Force (Retired),4,890,0,0.0,"STS-63 (Discovery), STS-84 (Atlantis), STS-114...",NaN,NaN
222,William C. McCool,1996.0,16.0,Deceased,9/23/1961,"San Diego, CA",Male,US Naval Academy; University of Maryland; US N...,Naval Sciences,Computer Science; Aeronautical Engineering,Commander,US Navy,1,382,0,0.0,STS-107 (Columbia),2/1/2003,STS-107 (Columbia)
162,Kathryn P. Hire,1995.0,15.0,Management,8/26/1959,"Mobile, AL",Female,US Naval Academy; Florida State Institute of T...,Engineering Management,Space Technology,Captain,US Naval Reserves,2,711,0,0.0,"STS-90 (Columbia), STS-130 (Endeavor)",NaN,NaN
21,Michael R. Barratt,2000.0,18.0,Active,4/16/1959,"Vancouver, WA",Male,University of Washington; Northwestern Univers...,Zoology,Medicine; Aerospace Medicine,NaN,NaN,2,5075,1,5.0,"ISS-19/20 (Soyuz), STS-133 (Discovery)",NaN,NaN
183,Scott J. Kelly,1996.0,16.0,Active,2/21/1964,"Orange, NJ",Male,State University of New York Maritime College;...,Electrical Engineering,Aviation Systems,Captain,US Navy (Retired),4,12490,3,18.0,"STS-103 (Discovery), STS-118 (Endeavor), ISS-2...",NaN,NaN
155,Thomas J. Hennen,NaN,NaN,Retired,8/17/1952,"Albany, GA",Male,NaN,NaN,NaN,Chief Warrant Officer,US Army (Retired),1,166,0,0.0,STS-44 (Atlantis),NaN,NaN

In [139]:
data.columns

Index(['Name', 'Year', 'Group', 'Status', 'Birth Date', 'Birth Place',
       'Gender', 'Alma Mater', 'Undergraduate Major', 'Graduate Major',
       'Military Rank', 'Military Branch', 'Space Flights',
       'Space Flight (hr)', 'Space Walks', 'Space Walks (hr)', 'Missions',
       'Death Date', 'Death Mission'],
      dtype='object')

In [161]:
# changing column name

data.columns = [11,22,33,44,55,66,77,88,99,100,111,222,333,444,555,666,777,888,999]
data.columns = ['Name', 'Year', 'Group', 'Status', 'Birth Date', 'Birth Place',
       'Gender', 'Alma Mater', 'Undergraduate Major', 'Graduate Major',
       'Military Rank', 'Military Branch', 'Space Flights',
       'Space Flight (hr)', 'Space Walks', 'Space Walks (hr)', 'Missions',
       'Death Date', 'Death Mission']

In [162]:
data.head(1)

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
0,Joseph M. Acaba,2004.0,19.0,Active,5/17/1967,"Inglewood, CA",Male,University of California-Santa Barbara; Univer...,Geology,Geology,NaN,NaN,2,3307,2,13.0,"STS-119 (Discovery), ISS-31/32 (Soyuz)",NaN,NaN

In [163]:
data.rename(columns={'Birth Date':'birth_date', 'Birth Place':'birth_place',
                   'Alma Mater':'alma_mater', 'Undergraduate Major':'undergraduate_major', 'Graduate Major':'graduate_major',
       'Military Rank':'military_rank', 'Military Branch':'military_branch', 'Space Flights':'space_fights',
       'Space Flight (hr)':'space_flight(hr)', 'Space Walks':'space_walks', 'Space Walks (hr)':'space_walks(hr)',
       'Death Date':"death_date",'Space Walks (hr)':'space_walks(hr)', 'Death Mission':'death_mission' },inplace=True)

In [164]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 357 entries, 0 to 356
Data columns (total 19 columns):
Name                   357 non-null object
Year                   331 non-null float64
Group                  330 non-null float64
Status                 357 non-null object
birth_date             357 non-null object
birth_place            357 non-null object
Gender                 357 non-null object
alma_mater             356 non-null object
undergraduate_major    335 non-null object
graduate_major         298 non-null object
military_rank          207 non-null object
military_branch        211 non-null object
space_fights           357 non-null int64
space_flight(hr)       357 non-null int64
space_walks            357 non-null int64
space_walks(hr)        357 non-null float64
Missions               334 non-null object
death_date             52 non-null object
death_mission          16 non-null object
dtypes: float64(3), int64(3), object(13)
memory usage: 53.1+ KB

In [165]:
data.notnull().sum()
data.isnull().sum()

Name                     0
Year                    26
Group                   27
Status                   0
birth_date               0
birth_place              0
Gender                   0
alma_mater               1
undergraduate_major     22
graduate_major          59
military_rank          150
military_branch        146
space_fights             0
space_flight(hr)         0
space_walks              0
space_walks(hr)          0
Missions                23
death_date             305
death_mission          341
dtype: int64

In [166]:
data.birth_date = pd.to_datetime(data.birth_date)

In [167]:
data.birth_date

0     1967-05-17
1     1936-03-07
2     1946-03-03
3     1951-05-20
4     1930-01-20
         ...
352   1956-08-23
353   1962-07-26
354   1932-02-07
355   1930-09-24
356   1962-06-29
Name: birth_date, Length: 357, dtype: datetime64[ns]

In [168]:
data.death_date = pd.to_datetime(data.death_date)

In [169]:
data.head(1)

,Name,Year,Group,Status,birth_date,birth_place,Gender,alma_mater,undergraduate_major,graduate_major,military_rank,military_branch,space_fights,space_flight(hr),space_walks,space_walks(hr),Missions,death_date,death_mission
0,Joseph M. Acaba,2004.0,19.0,Active,1967-05-17,"Inglewood, CA",Male,University of California-Santa Barbara; Univer...,Geology,Geology,NaN,NaN,2,3307,2,13.0,"STS-119 (Discovery), ISS-31/32 (Soyuz)",NaT,NaN

In [170]:
# we will deal you later 
#data.Year.astype('int32')
# data.Group.astype('int32')

In [171]:
data.Status.value_counts()

Retired       220
Deceased       51
Active         50
Management     36
Name: Status, dtype: int64

In [172]:
data.alma_mater.value_counts().sum()

356

In [173]:
#data.alma_mater.unique()
data.alma_mater.nunique()

280

In [174]:
pd.Series([11,2,np.nan, 33,33,55,6,55,np.nan]).unique()

array([11.,  2., nan, 33., 55.,  6.])

In [175]:
pd.Series([11,2,np.nan, 33,33,55,6,55,np.nan]).nunique()

5

In [176]:
data.Year

0      2004.0
1      1996.0
2      1984.0
3      1987.0
4      1963.0
        ...
352    1990.0
353    1998.0
354    1966.0
355    1962.0
356    1998.0
Name: Year, Length: 357, dtype: float64

In [177]:
data[data.Year.notnull()]

,Name,Year,Group,Status,birth_date,birth_place,Gender,alma_mater,undergraduate_major,graduate_major,military_rank,military_branch,space_fights,space_flight(hr),space_walks,space_walks(hr),Missions,death_date,death_mission
0,Joseph M. Acaba,2004.0,19.0,Active,1967-05-17,"Inglewood, CA",Male,University of California-Santa Barbara; Univer...,Geology,Geology,NaN,NaN,2,3307,2,13.0,"STS-119 (Discovery), ISS-31/32 (Soyuz)",NaT,NaN
1,Loren W. Acton,1996.0,NaN,Retired,1936-03-07,"Lewiston, MT",Male,Montana State University; University of Colorado,Engineering Physics,Solar Physics,NaN,NaN,1,190,0,0.0,STS 51-F (Challenger),NaT,NaN
2,James C. Adamson,1984.0,10.0,Retired,1946-03-03,"Warsaw, NY",Male,US Military Academy; Princeton University,Engineering,Aerospace Engineering,Colonel,US Army (Retired),2,334,0,0.0,"STS-28 (Columbia), STS-43 (Atlantis)",NaT,NaN
3,Thomas D. Akers,1987.0,12.0,Retired,1951-05-20,"St. Louis, MO",Male,University of Missouri-Rolla,Applied Mathematics,Applied Mathematics,Colonel,US Air Force (Retired),4,814,4,29.0,"STS-41 (Discovery), STS-49 (Endeavor), STS-61 ...",NaT,NaN
4,Buzz Aldrin,1963.0,3.0,Retired,1930-01-20,"Montclair, NJ",Male,US Military Academy; MIT,Mechanical Engineering,Astronautics,Colonel,US Air Force (Retired),2,289,2,8.0,"Gemini 12, Apollo 11",NaT,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
352,David A. Wolf,1990.0,13.0,Retired,1956-08-23,"Indianapolis, IN",Male,Purdue University; Indiana University,Electrical Engineering,Medicine,NaN,NaN,3,4044,7,41.0,STS-58 (Columbia). STS-86/89 (Atlantis/Endeavo...,NaT,NaN
353,Neil W. Woodward III,1998.0,17.0,Retired,1962-07-26,"Chicago, IL",Male,MIT; University of Texas-Austin; George Washin...,Physics,Physics; Business Management,Commander,US Navy,0,0,0,0.0,NaN,NaT,NaN
354,Alfred M. Worden,1966.0,5.0,Retired,1932-02-07,"Jackson, MI",Male,US Military Academy; University of Michigan,Military Science,Aeronautical & Astronautical Engineering,Colonel,US Air Force (Retired),1,295,1,0.5,Apollo 15,NaT,NaN
355,John W. Young,1962.0,2.0,Retired,1930-09-24,"San Francisco, CA",Male,Georgia Institute of Technology,Aeronautical Engineering,NaN,Captain,US Navy (Retired),6,835,3,20.0,"Gemini 3, Gemini 10, Apollo 10, Apollo 16, STS...",NaT,NaN
356,George D. Zamka,1998.0,17.0,Retired,1962-06-29,"Jersey City, NJ",Male,US Naval Academy; Florida Institute of Technology,Mathematics,Engineering Management,Colonel,US Marine Corps (Retired),2,692,0,0.0,"STS-120 (Discovery), STS-130 (Endeavor)",NaT,NaN

# Handling Missing Values 
    - filling missing values
    - dropping missing values

In [178]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 357 entries, 0 to 356
Data columns (total 19 columns):
Name                   357 non-null object
Year                   331 non-null float64
Group                  330 non-null float64
Status                 357 non-null object
birth_date             357 non-null datetime64[ns]
birth_place            357 non-null object
Gender                 357 non-null object
alma_mater             356 non-null object
undergraduate_major    335 non-null object
graduate_major         298 non-null object
military_rank          207 non-null object
military_branch        211 non-null object
space_fights           357 non-null int64
space_flight(hr)       357 non-null int64
space_walks            357 non-null int64
space_walks(hr)        357 non-null float64
Missions               334 non-null object
death_date             52 non-null datetime64[ns]
death_mission          16 non-null object
dtypes: datetime64[ns](2), float64(3), int64(3), object(11)
memory usage: 53.1+ KB

In [179]:
data.Year.isnull().sum()

26

In [180]:
data.Year.fillna(data.Year.mode(),inplace=True)

In [181]:
data.Year

0      2004.0
1      1996.0
2      1984.0
3      1987.0
4      1963.0
        ...
352    1990.0
353    1998.0
354    1966.0
355    1962.0
356    1998.0
Name: Year, Length: 357, dtype: float64

In [182]:
data.Year.isnull().sum()

26

In [183]:
data.fillna({
            'Group':data.Group.mode(),
            'alma_mater':data.alma_mater.mode(),
            'undergraduate_major':data.undergraduate_major.mode(),
            'graduate_major':data.graduate_major.mode(),
            })

,Name,Year,Group,Status,birth_date,birth_place,Gender,alma_mater,undergraduate_major,graduate_major,military_rank,military_branch,space_fights,space_flight(hr),space_walks,space_walks(hr),Missions,death_date,death_mission
0,Joseph M. Acaba,2004.0,19.0,Active,1967-05-17,"Inglewood, CA",Male,University of California-Santa Barbara; Univer...,Geology,Geology,NaN,NaN,2,3307,2,13.0,"STS-119 (Discovery), ISS-31/32 (Soyuz)",NaT,NaN
1,Loren W. Acton,1996.0,16.0,Retired,1936-03-07,"Lewiston, MT",Male,Montana State University; University of Colorado,Engineering Physics,Solar Physics,NaN,NaN,1,190,0,0.0,STS 51-F (Challenger),NaT,NaN
2,James C. Adamson,1984.0,10.0,Retired,1946-03-03,"Warsaw, NY",Male,US Military Academy; Princeton University,Engineering,Aerospace Engineering,Colonel,US Army (Retired),2,334,0,0.0,"STS-28 (Columbia), STS-43 (Atlantis)",NaT,NaN
3,Thomas D. Akers,1987.0,12.0,Retired,1951-05-20,"St. Louis, MO",Male,University of Missouri-Rolla,Applied Mathematics,Applied Mathematics,Colonel,US Air Force (Retired),4,814,4,29.0,"STS-41 (Discovery), STS-49 (Endeavor), STS-61 ...",NaT,NaN
4,Buzz Aldrin,1963.0,3.0,Retired,1930-01-20,"Montclair, NJ",Male,US Military Academy; MIT,Mechanical Engineering,Astronautics,Colonel,US Air Force (Retired),2,289,2,8.0,"Gemini 12, Apollo 11",NaT,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
352,David A. Wolf,1990.0,13.0,Retired,1956-08-23,"Indianapolis, IN",Male,Purdue University; Indiana University,Electrical Engineering,Medicine,NaN,NaN,3,4044,7,41.0,STS-58 (Columbia). STS-86/89 (Atlantis/Endeavo...,NaT,NaN
353,Neil W. Woodward III,1998.0,17.0,Retired,1962-07-26,"Chicago, IL",Male,MIT; University of Texas-Austin; George Washin...,Physics,Physics; Business Management,Commander,US Navy,0,0,0,0.0,NaN,NaT,NaN
354,Alfred M. Worden,1966.0,5.0,Retired,1932-02-07,"Jackson, MI",Male,US Military Academy; University of Michigan,Military Science,Aeronautical & Astronautical Engineering,Colonel,US Air Force (Retired),1,295,1,0.5,Apollo 15,NaT,NaN
355,John W. Young,1962.0,2.0,Retired,1930-09-24,"San Francisco, CA",Male,Georgia Institute of Technology,Aeronautical Engineering,NaN,Captain,US Navy (Retired),6,835,3,20.0,"Gemini 3, Gemini 10, Apollo 10, Apollo 16, STS...",NaT,NaN
356,George D. Zamka,1998.0,17.0,Retired,1962-06-29,"Jersey City, NJ",Male,US Naval Academy; Florida Institute of Technology,Mathematics,Engineering Management,Colonel,US Marine Corps (Retired),2,692,0,0.0,"STS-120 (Discovery), STS-130 (Endeavor)",NaT,NaN

In [160]:
data

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
0,Joseph M. Acaba,2004.0,19.0,Active,5/17/1967,"Inglewood, CA",Male,University of California-Santa Barbara; Univer...,Geology,Geology,NaN,NaN,2,3307,2,13.0,"STS-119 (Discovery), ISS-31/32 (Soyuz)",NaN,NaN
1,Loren W. Acton,1996.0,NaN,Retired,3/7/1936,"Lewiston, MT",Male,Montana State University; University of Colorado,Engineering Physics,Solar Physics,NaN,NaN,1,190,0,0.0,STS 51-F (Challenger),NaN,NaN
2,James C. Adamson,1984.0,10.0,Retired,3/3/1946,"Warsaw, NY",Male,US Military Academy; Princeton University,Engineering,Aerospace Engineering,Colonel,US Army (Retired),2,334,0,0.0,"STS-28 (Columbia), STS-43 (Atlantis)",NaN,NaN
3,Thomas D. Akers,1987.0,12.0,Retired,5/20/1951,"St. Louis, MO",Male,University of Missouri-Rolla,Applied Mathematics,Applied Mathematics,Colonel,US Air Force (Retired),4,814,4,29.0,"STS-41 (Discovery), STS-49 (Endeavor), STS-61 ...",NaN,NaN
4,Buzz Aldrin,1963.0,3.0,Retired,1/20/1930,"Montclair, NJ",Male,US Military Academy; MIT,Mechanical Engineering,Astronautics,Colonel,US Air Force (Retired),2,289,2,8.0,"Gemini 12, Apollo 11",NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
352,David A. Wolf,1990.0,13.0,Retired,8/23/1956,"Indianapolis, IN",Male,Purdue University; Indiana University,Electrical Engineering,Medicine,NaN,NaN,3,4044,7,41.0,STS-58 (Columbia). STS-86/89 (Atlantis/Endeavo...,NaN,NaN
353,Neil W. Woodward III,1998.0,17.0,Retired,7/26/1962,"Chicago, IL",Male,MIT; University of Texas-Austin; George Washin...,Physics,Physics; Business Management,Commander,US Navy,0,0,0,0.0,NaN,NaN,NaN
354,Alfred M. Worden,1966.0,5.0,Retired,2/7/1932,"Jackson, MI",Male,US Military Academy; University of Michigan,Military Science,Aeronautical & Astronautical Engineering,Colonel,US Air Force (Retired),1,295,1,0.5,Apollo 15,NaN,NaN
355,John W. Young,1962.0,2.0,Retired,9/24/1930,"San Francisco, CA",Male,Georgia Institute of Technology,Aeronautical Engineering,NaN,Captain,US Navy (Retired),6,835,3,20.0,"Gemini 3, Gemini 10, Apollo 10, Apollo 16, STS...",NaN,NaN
356,George D. Zamka,1998.0,17.0,Retired,6/29/1962,"Jersey City, NJ",Male,US Naval Academy; Florida Institute of Technology,Mathematics,Engineering Management,Colonel,US Marine Corps (Retired),2,692,0,0.0,"STS-120 (Discovery), STS-130 (Endeavor)",NaN,NaN

In [ ]:
data.fillna()

In [190]:
df = pd.read_excel("grouping.xlsx")
df

   ID    Names  Grades        Depts  Salaries
0   1     Asad      16     Accounts        NaN
1   2    Fahad      17     Taxation      123.0
2   3      NaN      18     Accounts      121.0
3   4   Afzal       19          NaN        NaN
4   5   Yasir       16  Information       99.0
5   6   Nasir       19          NaN      100.0
6   7      NaN      14     Accounts      123.0
7   8  Hassan       17  Information      122.0
8   9     Jami      17     Defence       156.0
9  10    Haseb      18          NaN      160.0

In [192]:
df.dropna(axis=0,how='any')

   ID    Names  Grades        Depts  Salaries
1   2    Fahad      17     Taxation      123.0
4   5   Yasir       16  Information       99.0
7   8  Hassan       17  Information      122.0
8   9     Jami      17     Defence       156.0

In [193]:
df.dropna(axis=1,how='any')

   ID  Grades
0   1      16
1   2      17
2   3      18
3   4      19
4   5      16
5   6      19
6   7      14
7   8      17
8   9      17
9  10      18

In [194]:
df.dropna(axis=0,how="all")

   ID    Names  Grades        Depts  Salaries
0   1     Asad      16     Accounts        NaN
1   2    Fahad      17     Taxation      123.0
2   3      NaN      18     Accounts      121.0
3   4   Afzal       19          NaN        NaN
4   5   Yasir       16  Information       99.0
5   6   Nasir       19          NaN      100.0
6   7      NaN      14     Accounts      123.0
7   8  Hassan       17  Information      122.0
8   9     Jami      17     Defence       156.0
9  10    Haseb      18          NaN      160.0

In [195]:
df.dropna(axis=1,how="all")

   ID    Names  Grades        Depts  Salaries
0   1     Asad      16     Accounts        NaN
1   2    Fahad      17     Taxation      123.0
2   3      NaN      18     Accounts      121.0
3   4   Afzal       19          NaN        NaN
4   5   Yasir       16  Information       99.0
5   6   Nasir       19          NaN      100.0
6   7      NaN      14     Accounts      123.0
7   8  Hassan       17  Information      122.0
8   9     Jami      17     Defence       156.0
9  10    Haseb      18          NaN      160.0

In [196]:
df['Na_Vals'] = np.nan

In [199]:
df.iloc[9:,:]=np.nan

In [200]:
df

    ID    Names  Grades        Depts  Salaries   Na_Vals
0  1.0     Asad    16.0     Accounts        NaN      NaN
1  2.0    Fahad    17.0     Taxation      123.0      NaN
2  3.0      NaN    18.0     Accounts      121.0      NaN
3  4.0   Afzal     19.0          NaN        NaN      NaN
4  5.0   Yasir     16.0  Information       99.0      NaN
5  6.0   Nasir     19.0          NaN      100.0      NaN
6  7.0      NaN    14.0     Accounts      123.0      NaN
7  8.0  Hassan     17.0  Information      122.0      NaN
8  9.0     Jami    17.0     Defence       156.0      NaN
9  NaN      NaN     NaN          NaN        NaN      NaN

In [201]:
df.dropna(axis=0, how='all')

    ID    Names  Grades        Depts  Salaries   Na_Vals
0  1.0     Asad    16.0     Accounts        NaN      NaN
1  2.0    Fahad    17.0     Taxation      123.0      NaN
2  3.0      NaN    18.0     Accounts      121.0      NaN
3  4.0   Afzal     19.0          NaN        NaN      NaN
4  5.0   Yasir     16.0  Information       99.0      NaN
5  6.0   Nasir     19.0          NaN      100.0      NaN
6  7.0      NaN    14.0     Accounts      123.0      NaN
7  8.0  Hassan     17.0  Information      122.0      NaN
8  9.0     Jami    17.0     Defence       156.0      NaN

In [203]:
df.dropna(axis=1, how='all')

    ID    Names  Grades        Depts  Salaries
0  1.0     Asad    16.0     Accounts        NaN
1  2.0    Fahad    17.0     Taxation      123.0
2  3.0      NaN    18.0     Accounts      121.0
3  4.0   Afzal     19.0          NaN        NaN
4  5.0   Yasir     16.0  Information       99.0
5  6.0   Nasir     19.0          NaN      100.0
6  7.0      NaN    14.0     Accounts      123.0
7  8.0  Hassan     17.0  Information      122.0
8  9.0     Jami    17.0     Defence       156.0
9  NaN      NaN     NaN          NaN        NaN

In [204]:
df

    ID    Names  Grades        Depts  Salaries   Na_Vals
0  1.0     Asad    16.0     Accounts        NaN      NaN
1  2.0    Fahad    17.0     Taxation      123.0      NaN
2  3.0      NaN    18.0     Accounts      121.0      NaN
3  4.0   Afzal     19.0          NaN        NaN      NaN
4  5.0   Yasir     16.0  Information       99.0      NaN
5  6.0   Nasir     19.0          NaN      100.0      NaN
6  7.0      NaN    14.0     Accounts      123.0      NaN
7  8.0  Hassan     17.0  Information      122.0      NaN
8  9.0     Jami    17.0     Defence       156.0      NaN
9  NaN      NaN     NaN          NaN        NaN      NaN

In [206]:
df.dropna(axis=0,thresh=5)

    ID    Names  Grades        Depts  Salaries   Na_Vals
1  2.0    Fahad    17.0     Taxation      123.0      NaN
4  5.0   Yasir     16.0  Information       99.0      NaN
7  8.0  Hassan     17.0  Information      122.0      NaN
8  9.0     Jami    17.0     Defence       156.0      NaN

In [208]:
df.dropna(axis=1,thresh=4)

    ID    Names  Grades        Depts  Salaries
0  1.0     Asad    16.0     Accounts        NaN
1  2.0    Fahad    17.0     Taxation      123.0
2  3.0      NaN    18.0     Accounts      121.0
3  4.0   Afzal     19.0          NaN        NaN
4  5.0   Yasir     16.0  Information       99.0
5  6.0   Nasir     19.0          NaN      100.0
6  7.0      NaN    14.0     Accounts      123.0
7  8.0  Hassan     17.0  Information      122.0
8  9.0     Jami    17.0     Defence       156.0
9  NaN      NaN     NaN          NaN        NaN

# Handling Duplicates Records

In [213]:
df.iloc[10:,:]=np.nan

In [215]:
df.iloc[8,:] = np.nan

In [216]:
df

    ID    Names  Grades        Depts  Salaries   Na_Vals
0  1.0     Asad    16.0     Accounts        NaN      NaN
1  2.0    Fahad    17.0     Taxation      123.0      NaN
2  3.0      NaN    18.0     Accounts      121.0      NaN
3  4.0   Afzal     19.0          NaN        NaN      NaN
4  5.0   Yasir     16.0  Information       99.0      NaN
5  6.0   Nasir     19.0          NaN      100.0      NaN
6  7.0      NaN    14.0     Accounts      123.0      NaN
7  8.0  Hassan     17.0  Information      122.0      NaN
8  NaN      NaN     NaN          NaN        NaN      NaN
9  NaN      NaN     NaN          NaN        NaN      NaN

In [219]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9     True
dtype: bool

In [220]:
df.duplicated().sum()

1

In [223]:
df.drop_duplicates(subset=['Depts', 'Na_Vals'])

    ID   Names  Grades        Depts  Salaries   Na_Vals
0  1.0    Asad    16.0     Accounts        NaN      NaN
1  2.0   Fahad    17.0     Taxation      123.0      NaN
3  4.0  Afzal     19.0          NaN        NaN      NaN
4  5.0  Yasir     16.0  Information       99.0      NaN